post/elisp-hack-compress-and-convert-video.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-02-26 Wed 00:28 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>视频压缩及格式(gif)转换</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Kinney Zhang">

<link rel="shortcut icon" href="/static/img/favicon.ico"/>
<link rel="bookmark" href="/static/img/favicon.ico" type="image/x-icon"/>
<link id="pagestyle" rel="stylesheet" type="text/css" href="/static/light.css"/>
<!-- Google Analytics -->
<!-- End Google Analytics -->
</head>
<body>

<div id="org-div-header">
<div class="toptitle">
<span href="/post/index.html">Geekinney Blog</span>
<span onclick="switchTheme();">切换主题</span>
</div>
<div class="topnav">
<a href="/index.html">首页</a>&nbsp;|&nbsp;
<a href="/archive.html">归档</a>&nbsp;|&nbsp;
<a href="/category.html">分类</a>&nbsp;|&nbsp;
<a href="/bookmark.html">书签</a>&nbsp;|&nbsp;
<a href="/friendly-link.html">友链</a>&nbsp;|&nbsp;
<a href="/message.html">留言</a>&nbsp;|&nbsp;
<a href="https://github.com/Kinneyzhang">Github</a>&nbsp;
</div>
</div><div id="content">
<header>
<h1 class="title">视频压缩及格式(gif)转换</h1>
</header><div class="org-center">
<p>
[ 分类: Emacs / 日期: 2020-02-20 / 字数: 347 ]
</p>
</div>

<p>
MacOS系统使用 <code>mov</code> 作为默认视频格式， <code>mov</code> 格式的缺点是文件体积大，不便传输与使用。大多数时候我需要将视频压缩为 <code>mp4</code> 格式。同时，作为程序员，写文档时经常需要使用 <code>gif</code> 图片展示hack效果，所以将视频转换为gif也成了硬需求之一。关于视频的压缩与格式转换，有很多在线工具以及app可以实现，但我更钟爱命令行工具。因为命令行比封装好的ui使用方便，可选参数多。最重要的是，可以和emacs结合。
</p>

<p>
<a href="https://www.ffmpeg.org/ffmpeg.html">ffmpeg</a> 是一个非常优秀的视频处理命令，MacOS下可使用homebrew安装。做了下小hack，以后就可以在emacs中处理视频文件，生成gif啦。
</p>

<div class="col-auto">
<pre><code class="emacs-lisp">(defun my/video-compress-and-convert (video new)
  "compress and convert video"
  (interactive "fvideo path: \nfnew item path: ")
  (let ((video-format (cadr (split-string video "\\."))))
    (if (string= video-format "gif")
	(progn
	  (shell-command (concat "ffmpeg -i " video " -r 5 " new))
	  (message "%s convert to %s successfully!" video new))
      (progn
	(shell-command
	 (concat "ffmpeg -i " video " -vcodec libx264 -b:v 5000k -minrate 5000k -maxrate 5000k -bufsize 4200k -preset fast -crf 20 -y -acodec libmp3lame -ab 128k " new))
	(message "%s compress and convert to %s successfully!" video new)))
    ))
</code></pre>
</div>

<p>
除此之外， <code>ffmpeg</code> 的功能远不止这些，还支持视频的录制、剪辑合并、加滤镜和音频处理等，读者可以访问 <a href="https://www.ffmpeg.org">ffmpeg官网</a> 探索。
</p>
</div>
<div id="postamble" class="status">

<script src="/static/jQuery.min.js"></script>
<script src="/static/Valine.min.js"></script>
<script src="/static/highlight.min.js"></script>
<script>var hlf=function(){Array.prototype.forEach.call(document.querySelectorAll("pre.src"),function(t){var e;e=t.getAttribute("class").toLowerCase(),e=e.replace(/src-(w+)/,"src-$1 $1"),console.log(e),t.setAttribute("class",e),hljs.highlightBlock(t)})};addEventListener("DOMContentLoaded",hlf);</script>

<div id="vcomments"></div>
<script>
new Valine({
el: '#vcomments',
appId: 'jVMbXK6tJDtPCzR3Mp0V5L6V-gzGzoHsz',
appKey: 'SX4oRFXp8K7KgeGhKTTDy3VI',
visitor: true,
notify: true,
verify: false,
avatar: 'identicon',
placeholder: '留下你的评论吧～'
})
</script>
<p class="author">Author: Kinney Zhang (<a href="mailto:kinneyzhang666@gmail.com">kinneyzhang666@gmail.com</a>)</p>
<p class="date">Date: 2020-02-20</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>


<script>
$(document).ready(function(){
var theme = sessionStorage.getItem("theme");
if(theme=="dark"){
document.getElementById("pagestyle").href="/static/dark.css";
}else if(theme=="light"){
document.getElementById("pagestyle").href="/static/light.css";
}else{
sessionStorage.setItem("theme","light");
}});

function switchTheme(){
if(sessionStorage.getItem("flag")=="false"){
document.getElementById("pagestyle").href="/static/light.css";
sessionStorage.setItem("theme","light");
sessionStorage.setItem("flag", "true");
}else{
document.getElementById("pagestyle").href="/static/dark.css";
sessionStorage.setItem("theme","dark");
sessionStorage.setItem("flag", "false");
}};
</script>
</div>
</body>
</html>
